<template>
  <v-container>
    <v-layout wrap row>
      <v-flex xs12>
        <h2>이거샀어?</h2>
        <p>외출했을때 핸드폰으로 거래 입력할때 불편함을 느끼던차 거의 대부분의 거래가 재 입력으로 이루어지는것을 느끼고 재입력에 특화된 입력기를 만들어보았습니다.</p>

        <h3>간단한 사용설명</h3>
        <ol class="mb-3">
          <li>로그인은 오른쪽위 아이콘을 눌러주세오.</li>
          <li>후잉로그인후 셋팅 화면에서 대시보드에 표시할 항목을 선택해주세요</li>
          <li>대시보드에서는 현재 잔액을 표시합니다.</li>
          <li>항목을 클릭하면 입력기로 이동합니다.</li>
          <li>클릭한 항목이 오른쪽으로 기본 선택 됩니다.</li>
          <li>아래쪽에는 자주 입력하는 거래가 표시됩니다.</li>
          <li>아래쪽 리스트에서 항목을 클릭하면 해당 항목이 선택된 상태가 됩니다.</li>
          <li>금액을 입력하신후 전송 버튼을 누르면 후잉에 거래가 등록됩니다.</li>
        </ol>

        <h3>주의사항</h3>
        <p>현재 베타 테스트 버전으로 기본기능 이외에는 구현되지 않거나 정상적으로 동작 되지 않을수 있습니다.
          <br>셋팅정보는 단말기안에 저장되며 로그아웃시 삭제됩니다.
          <br>(차후에 로그아웃 하더라도 셋팅정보를 저장하는 기능을 추가 예정입니다.)
          <br>서버가 슬립상태에 들어가 있을경우 최초 응답시간이 느려지는 경우가 있습니다. 10~20초 대기해주시면 정상적으로 이용가능합니다.
          <br>
        </p>
        <h3>PWA에 대해서</h3>
        <p>안드로이드 크롬으로 접속시 아래에 표시되는 메세지를 이용해서 홈화면에 등록할수 있습니다.
          <br>기능상 차이는 없으나 주소창이 없어서 더 넓은 화면을 사용할수 있습니다.
          <br>
        </p>

        <h3>버그및 수정건의</h3>
        <p>
          <a href="https://github.com/XeO3/i-bought-it/issues" target="_blank">깃허브 이슈</a>에 등록 부탁드립니다.
          <br>퇴근하고 짬짬히 개발하고 있어서 반영이 늦어질수 있는점 양해 부탁드립니다.
        </p>
      </v-flex>
    </v-layout>
  </v-container>
</template>
